app/controllers/products_controller.rb

SELECT COUNT(*) FROM `products`
SELECT `products`.* FROM `products` LIMIT 10 OFFSET 0
---
  def home
    @products = Product.paginate(:page => params[:page], :per_page => 9,:order => "name")

SELECT `products`.* FROM `products` WHERE (name LIKE '%sgs\'%')
---
  def search
     @products = Product.search(params[:search])

SELECT COUNT(*) FROM `products`
SELECT `products`.* FROM `products` ORDER BY name LIMIT 10 OFFSET 0
---
  def index
@products = Product.paginate(:page => params[:page], :per_page => 10,:order => "name")

INSERT INTO `products` (`created_at`, `image`, `info`, `name`, `price`, `quantity`, `updated_at`) VALUES ('2013-10-29 07:42:36', 'download.jpg', 'fafaf', 'faffafa', 8, 7, '2013-10-29 07:42:36')
---
  def create
    handle_image_upload(params)
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE `products` SET `info` = 'qwqwqwq111', `image` = 'download.jpg', `updated_at` = '2013-10-29 07:44:01' WHERE `products`.`id` = 1
---
  def update
    handle_image_upload(params)
    respond_to do |format|
      if @product.update(product_params)